/*Пользователь указывает объем флешки в Гб. 
Программа должна сосчитать сколько файлов размером 820 Мб помещается на флешку.*/ 

/* let fleshka = prompt('Введите размер флешки', '');
let fail = 820;
let res = fleshka / fail;
alert(res); */


/*Выполни добавление строки "1" и цифры 2 (обе операнды должны быть в переменных),
 добьемся математически правильного ответа.*/

/* let str = '1';
let num = 2;
alert(str + num) ;
 */

/*Выполни сложение 0,1 и 0,2 добьтесь математически правильного ответа.*/

/* let a = 0.1;
let b = 0.2;
d = a + b;
alert(d.toFixed(1)); */