/*1. Создай объект, описывающий автомобиль
(производитель, модель,  год выпуска, средняя скорость, объем топливного бака,
средний расход топлива на 100 км., водители), 
И следующие функции для работы с этим объектом:
1)Вывод на экран с информацией об автомобиле.
2)Добавление водителя, имеющего право управлять автомобилем.
3)Заправка автомобиля.
4)Подсчет необходимого времени для преодоления переданного расстояния со средней скоростью.
Учитывай, что через каждые 4 часа дороги водителю необходимо делать перерыв на 1 час,
а также нужно проверять вправе ли водитель управлять данным автомобилем
(имя водителя функция принимает вторым аргументом).

.*/

let autoModel = { 
    creatModel: 'France',
    nameModel: 'Venom 13 Zero',
    yearModel: '1996',
    averageSpeed: '666',
    driverModel: 'Starck',
    "Maximum Speed " : '1000',
}


/* delete autoModel.creatModel;//удалить
autoModel.isAdmin = "Mister";//добавить

console.log(autoModel); */






